package  Lab6;

import java.util.StringTokenizer;

public class Example_StringToken{
    public static void  main(String[] args){
        StringBuffer str = new StringBuffer("Mind Mapping แผนภูมิความคิดเพื่อแก้ไขปัญหา\n" +
                "\n" +
                "การทำแผนภูมิความคิดหรือ Mind Mapping ถือเป็นการกระตุ้นสมอง ให้เกิดความคิดที่เป็น อิสระจากปัญหาที่เป็นศูนย์กลาง ออกไปสู่วิธีแก้ปัญหาต่างๆ " +
                "ที่แปลกและแตกต่างจากเดิม ซึ่งสามารถทำได้โดยเริ่มจากการเขียนสาเหตุของปัญหาไว้กลางหน้ากระดาษ แล้วลากเส้นโยงออกมารอบๆ \n" +
                "ถ้าคิดวิธีแก้ไขได้ ก็ให้เขียนวิธีนั้น ไว้เหนือเส้นที่เพิ่งลากออกมา ถ้าความคิดไหนสัมพันธ์หรือสนับสนุนวิธีแก้ไขที่มีอยู่แล้ว ก็ให้เติมความคิดใหม่นั้น " +
                "ต่ออกมาจากวิธีแก้เดิม ด้วยการลากเส้นแขนงออกจากเส้นหลัก แล้วเขียนความคิดใหม่กำกับลงไป เมื่อเราได้ความคิดใหม่ๆที่หลากหลายแล้ว ก" +
                "็สามารถนำความคิดเหล่านั้นไปใช้ในขั้นตอนของ การวางแผนแก้ไขปัญหาได้ครับ\n" +
                "\n" +
                "Brainstorming ระดมสมองเพื่อแก้ไขปัญหา\n" +
                "\n" +
                "การระดมสมอง หรือ Brainstroming คือการะดมความคิดจากหลายๆคน เพื่อคิดหาสาเหตุและวิธีแก้ไขปัญหาที่ถูกต้อง เหมาะสม และได้ผลดี" +
                " ซึ่งจำเป็นต้องมีการวางกฎพื้นฐานในการระดมสมองไว้ เพื่อเป็นกรอบหรือแนวทางพื้นฐาน เช่น ไม่มีการวิพากษ์วิจารณ์ หรือตัดสินว่าความคิดใดดีหรือไม่ดี " +
                "ถ้าใครคิดวิธีการอะไรได้ต้องกล้าพูดอกมา และอย่าอายที่จะนำความคิดของคนอื่น มาผสมผสานกับความคิดของตน เพื่อสร้างเป็นความคิดใหม่… " +
                "นอกจากนี้ยังต้องมีการวางขั้นตอนในการระดมสมองให้เป็นลำดับ เช่น กำหนดเวลาในการระดมสมอง กำหนดให้มีคนจดวิธีแก้ปัญหา " +
                "เขียนสาเหตุของปัญหาที่ต้องการจะแก้ให้เห็นชัดเจน และให้สมาชิกทุกคนแสดงความคิดเห็นเรียงกันไปทีละคน ที่สำคัญต้องจดทุกความคิด" +
                "เพื่อนำไปประเมินและคัดเลือกในภายหลังครับ.")
                StringTokenizer strToken = new StringTokenizer(Str.toString());

    }
}

